export const ODDS_TYPE = {
  americanPrice: 5,
  decimalPrice: 3,
  hongKongPrice: 2,
  indoPrice: 4,
  malayPrice: 1,
};

export const BET_TYPE_MAP = {
  // 大小球
  BigLittle: [3, 8, 18, 144, 156, 163, 178, 197, 198, 204, 205, 386, 387, 388, 389, 401, 402, 403, 404, 461, 462, 43, 464, 469, 482, 483, 484, 485, 610, 615, 616, 638, 639, 640, 641, 705, 709, 1306, 1312, 9003, 9009, 9013, 9019, 9025, 9029, 9035, 9041, 9047, 9053, 9058, 9060, 9070],
  // 独赢
  Solo: [5, 15, 167, 176, 177, 385, 430, 458, 459, 501, 630, 1301, 9538, 28, 24, 22],
  // 让球
  Let: [1, 7, 17, 468, 609],
  // 单双
  OddsEven: [2, 12, 184, 194, 203, 393, 394, 400, 428, 450, 470, 471, 472, 611, 632, 706, 710, 1305, 1318, 9005, 9061, 9071, 9078, 9080, 9081, 9082, 9083, 9084, 9085, 9086, 9496, 9497, 9498, 9499, 9500, 9501, 9502, 9503, 9504, 9505, 9506, 9507, 9508, 9509, 9510, 9511, 9512, 9513, 9514, 9515, 9516, 9517, 9518, 9519],
  // 输赢
  WinLoss: [20, 21],
  // 波胆
  Ball: [152, 165, 166, 392, 399, 405, 413, 414, 416, 1302, 1317, 171, 397, 408, 426],
  // 进球累
  Goal: [6, 14, 126, 127, 140, 141, 142, 143, 144, 145, 146, 147, 148, 159, 160, 161, 162, 163, 164, 169, 170, 172, 174, 179, 180, 181, 182, 187, 188, 192, 193, 391, 395, 396, 406, 407, 409, 412, 415, 417, 418, 420, 421, 424, 427, 429, 433, 436, 437, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 455, 456, 457, 467, 6, 126, 143, 144, 159, 161, 162, 163, 179, 187, 391, 406, 407, 409, 412, 418, 429, 449, 450, 457, 467],
  YesNo: [],
  // 失球
  LoseGoal: [13, 27],
  // 胜队
  WinTeam: [25, 185, 191, 411, 432],
  // 下一个xx时间内会发生的组合事件
  NextCombo: [226, 227, 376],
};

export const getBetTypeName = (type) => {
  let name = '';
  Object.keys(BET_TYPE_MAP).forEach((key) => {
    if (BET_TYPE_MAP[key]?.includes(type)) {
      name = key;
    }
  });
  return name || type;
};

export const SPORT_TYPE = (t) => [
    {
      sportType: 1,
      sportName: t('足球'),
      liveGameCount: 0,
      count: 0,
    },
    {
      sportType: 2,
      sportName: t('篮球'),
      count: 0,
    },
    {
      sportType: 5,
      sportName: t('网球'),
      count: 0,
    },
    {
      sportType: 6,
      sportName: t('排球'),
      count: 0,
    },
    {
      sportType: 18,
      sportName: t('羽毛球'),
      count: 0,
    },
    {
      sportType: 18,
      sportName: t('乒乓球'),
      count: 0,
    },
    {
      sportType: 18,
      sportName: t('冰球'),
      count: 0,
    },
  ];
