<template>
  <div
    class="regular-wrap"
    v-for="(item, index) in navMap"
    :key="index"
  >
    <div class="regular-wrap-title">
      <h5 class="bold">{{ item.title }}</h5>
    </div>
    <div class="regular-wrap-main">
      <content v-html="item.content.join('<br />')" />
    </div>
  </div>
</template>

<script setup>
import { useI18n } from 'vue-i18n';

const { t } = useI18n();
const navMap = [
  {
    title: t('特别声明'),
    content: [
      t('1.此规则与条款适用于本公司所有体育投注种类。会员有责任明确了解所有的规则与条款。'),
      t('2.本公司保留随时修改规则与条款的权力，并且将修改后的内容公布于本网站上。'),
      t('3.网站上的公告亦作为投注的附加规则与条款。若有差距或矛盾之，以附加说明为准。'),
      t('4.本公司力求条款公平与公正，若您有任何意见及疑问，请联络客服部，我们将热诚友善并即时协助每位会员解决问题。若有任何错误或争议，本公司客服将全力指定协助。'),
      t('5.所有的条款用于在会员与公司之间共同依循的原则，希望通过条款在争议发生于让双方都得到满意的解决方案。'),
      t('6.为了避免出现争议，请务必在下注之后检查【注单记录】及【我的注单】。'),
      t('7.有意与本公司往来之客户，应注意其国家或居住地的相关法律规定，如有疑问应就相关问题，寻求当地法律见解。本公司将不接受任何客户因违反当地相关法令所引起之任何责任。'),
    ],
  },
  {
    title: t('一般体育规则'),
    content: [
      t('所有在本公司进行的投注都需要依照以下规则与条款处理。在个别体育项目里注明的规则将视为体育主要规则：'),
      t('1.所有投注项目的最高和最低投注额将由公司决定，如有任何更改无需提前通知。'),
      t('2.会员申请帐户时需指定正确的个人资讯，本公司对指定伪造或错误资讯的帐户将不负任何责任。'),
      t('3.会员将全权负责帐户提交的所有交易。在投注前请仔细检查选项，一旦投注提交成功后，将无法更改或取消。公司对会员自身原因造成的遗漏或重复投注不负任何责任。会员可以在’交易记录’中查看详情确保所有提交的注单已成功。'),
      t('4.在任何投诉中，若在公司的资料库中没有存储任何记录，公司将不接受也不认可任何会员指定的影本或单据。'),
      t('5.公司保留在任何时候关闭或冻结会员帐号的权力。'),
      t('6.公司保留在任何时候暂停／中止会员对任何盘口进行投注的权力。'),
      t('7.公司对已预知赛果的投注保留取消的权力，若由于 【滚球现场】 延迟而引起盘口赔率错误，此期间的注单将视为无效。'),
      t('8.滚球赛事时间、计时器和红牌等资讯仅供会员参考，公司对此资讯的准确性不负任何责任。'),
      t('9.若比赛或赛事取消，中断或延迟并且没有在官方指定开球时间的24小时内重新开始，所有该场赛事的投注将被视为无效且取消，除非在个别体育规则里另有指定注明。 公司取消该赛事所有注单的结果被视为最终决定，无需参考官方赛事裁判或相关部门的决定。混合投注将会继续按照注单剩余赛事的赛果结算。'),
      t('10.若对其它语言版本的资讯或球赛队名有争议，请以英文网站的名称为准。'),
      t('11.本公司对于联盟名称、队伍或参赛者之中文名称保有最终随时调整之权利，如有任何更改无需提前通知。'),
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('1.公司不负责下列原因所造成的损失。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('2.公司的网站、伺服器或网路中断。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('3.公司资料库、伺服器丢失资讯或资讯遭受破坏。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('4.不法分子攻击网站、伺服器或网路供应商。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('5.进入网站时由于网路供应商原因造成的网路缓慢。')}`,
      t('12.若对此规则与条款的内容有任何疑义，请以本公司解释为准。'),
      t('13.赛事之举办场地依照比赛主办单位的排定，若与本公司提供之主客队或中立场地的资讯有出入时，皆以本公司开出之正确赔率为准。'),
    ],
  },
  {
    title: t('赛果和派彩'),
    content: [
      t('1.派彩通常在赛事结束后进行，但考虑到会员的利益，某些投注会在官方公布赛果前先行派彩，但本公司仍保留因提前派彩所造成的错误进行更改赛果的权力。'),
      t('2.派彩依据官方来源或相关体育权威机构判定的结果为准。'),
      t('3.即使会员提供交易记录的截图或影印，所有的交易仍以公司最新备份资料记录为准。'),
    ],
  },
  {
    title: t('滚球类型投注'),
    content: [
      t('滚球投注是指对正在进行比赛的赛事进行投注。注单会在赛事进行比赛后开始接收并在盘口关盘后停止所有交易。个别体育会开出多个滚球种类的盘口供投注。'),
      t('1.会员投注滚球时，若赛场中出现以下几种情况，注单将会维持在 【等待中】 的状态。危险球的定义有：'),
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('1.12码罚球')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('2.自由球（攻方在守方禁区附近的自由球）')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('3.角球／掷入球（攻方靠近守方禁区的掷入球）')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('4.A队向B队禁区附近进攻（或B队在A队的禁区附近进攻）')}`,
      t('2.投注提交时若到危险球的情况，注单上会出现 【等待中】 的状态。表示注单在等待接受期间可能被取消；一旦危险球时间结束，且期间没有任何显著影响赛事状态的情况，注单就会被接受。'),
      t('3.若危险球期间遭遇进球或发生其他影响赛事进行的情况（例如：红牌…等），所有 【等待中】注单会被取消并退还注额。'),
      t('4.在滚球投注中，本公司强调以下条款以确保投注依照正确的时间、赔率并在正确的情况下进行：'),
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('1.若有合理的理由怀疑注单是在比赛中特定事件发生后才提交，本公司保留取消此注单并且不需任何理由和证明的权力。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('2.若发生网站无法更新比分、赔率或盘口的情况，本公司保留取消所有未结算且在处理中注单的权力。')}`,
      t('5.滚球计时器仅供参考，不作为派彩之依据。'),
    ],
  },
  {
    title: t('时间规则'),
    content: [
      t('1.若比赛提早于法定时间开始，比赛开始前的投注依然有效，比赛开始后的所有注单一律无效（滚球投注除外）。'),
      t('2.完整足球赛事以各联盟官方所公布的法定完场时间，以及受伤补停时间结果为准(包括某些法定完场时间少于90分钟之特定赛事及友谊赛)。'),
      t('3.除非在个别体育规则另有说明，加时得分则不计算在正常完场时间内。'),
      t('4.计时器：滚球比赛时间显示只供会员参考之用，如比赛时间有所误差，我们概不对此负责。'),
    ],
  },
  {
    title: t('场地变更'),
    content: [
      t('1.在赛事开赛前，比赛队伍之主场或中立场有任何更改，本公司将依据盘口与行情差距保留更改前的注单是否有效之权力。'),
      t('2.本公司保留取消任何可能受赛事更换场地而影响结果注单的权力，例如：网球比赛更换场地表面。'),
      t('3.若比赛原定在中立场改为在非中立场进行，在本公司判定对比赛没有影响的情况下，注单将继续保持有效。'),
      t('4.在个别体育项目里若有特别说明，以特别说明为主。'),
    ],
  },
  {
    title: t('错误'),
    content: [
      t('1.本公司力求降低错误的发生率，但若有注单在盘口显然有误的情况下提交，我们保留取消此注单的权力。错误的情况包括：'),
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('1.赔率错误（和市场上的行情有明显差别）。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('2.盘口资讯错误，例如：让球（分）数，大／小球（分）数等。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('3。赛事资讯错误，例如：参赛队名、队员、赛事日期或开赛时间。')}`,
      `&nbsp;&nbsp;&nbsp;&nbsp;${t('2.若因上述情况需取消注单，我们会尽可能的与客户取得联系，有关讯息也会即时公布在会员端跑马灯。')}`,
    ],
  },
  {
    title: t('异常投注'),
    content: [
      t('1.对任何怀疑在投注时涉嫌作弊或破坏本公司投注平台的会员，公司有权在毫无警告或通知下取消此会员不当得利的所有注单，并且限制投注。异常行为包含使用任何形式的设备、任何电脑程式与软体，以及不公平的下注方式，包含双边下注、无风险下注、套利下注等等；以上皆列为干涉本网站运作的异常行为。'),
    ],
  },
  {
    title: t('并列名次规则'),
    content: [
      t('1.若赛事产生两名或以上的获胜者，注单派彩计算为： （投注本金／获胜者数 × 赔率）－（投注本金／获胜者数）'),
      t('2.范例：某场赛果产生了三名获胜者，注单派彩计算如下： （投注本金／3 × 赔率）－（投注本金／3）'),
    ],
  },
  {
    title: t('最高派彩金额'),
    content: [
      t('1.混合过关最高派彩金额依系统提示为主。'),
    ],
  },
];

</script>

<style lang="less" scoped>
.regular-wrap {
  margin-bottom: 40px;

  &-title {
    display: flex;
    align-items: center;
    line-height: 40px;
    padding: 38px 0 26px;

    h5 {
      color: var(--dark-fff);
      font-size: 32px;
      margin: 0 14px 0 20px;
      position: relative;

      &::before {
        content: '';
        display: block;
        width: 8px;
        height: 28px;
        background-color: var(--theme-color);
        border-radius: 4px;
        position: absolute;
        top: 6px;
        left: -20px;
      }
    }

    span {
      color: var(--font-color-848A9A);
      font-size: 24px;
    }
  }

  &-main {
    content {
      font-size: 28px;
      line-height: 48px;
      color: var(--dark-fff, var(--font-color-404040)) !important;
    }
  }
}
</style>
